results.txt
VEs 2

export HF_ALLOW_CODE_EVAL=1; export LM_ADDR=127.0.0.1; export LM_PORT=8688; export LM_MODEL=/root/.cache/huggingface/GLM-4.5-FP8; export LM_BATCH_SIZE=1; export LM_LIMIT=32
export LM_CONCURRENCY=1; python vllm/benchmarks/benchmark_serving.py --backend vllm --model ${LM_MODEL} --trust-remote-code --host ${LM_ADDR} --port ${LM_PORT} --dataset-name random --random-input-len 30151 --random-output-len 230 --random-range-ratio 0.8 --num-prompts 16 --request-rate inf --seed 0 --ignore_eos --max-concurrency ${LM_CONCURRENCY} --percentile-metrics ttft,tpot,itl,e2el  --metric-percentiles 10,90,99
export LM_CONCURRENCY=2; python vllm/benchmarks/benchmark_serving.py --backend vllm --model ${LM_MODEL} --trust-remote-code --host ${LM_ADDR} --port ${LM_PORT} --dataset-name random --random-input-len 30151 --random-output-len 230 --random-range-ratio 0.8 --num-prompts 32 --request-rate inf --seed 0 --ignore_eos --max-concurrency ${LM_CONCURRENCY} --percentile-metrics ttft,tpot,itl,e2el  --metric-percentiles 10,90,99
export LM_CONCURRENCY=4; python vllm/benchmarks/benchmark_serving.py --backend vllm --model ${LM_MODEL} --trust-remote-code --host ${LM_ADDR} --port ${LM_PORT} --dataset-name random --random-input-len 30151 --random-output-len 230 --random-range-ratio 0.8 --num-prompts 64 --request-rate inf --seed 0 --ignore_eos --max-concurrency ${LM_CONCURRENCY} --percentile-metrics ttft,tpot,itl,e2el  --metric-percentiles 10,90,99
export LM_CONCURRENCY=1; lm_eval --model local-completions \
  --tasks gsm8k,humaneval \
  --model_args model=$LM_MODEL,base_url=http://$LM_ADDR:$LM_PORT/v1/completions,num_concurrent=$LM_CONCURRENCY,trust_remote_code=True \
  --batch_size $LM_BATCH_SIZE \
  --confirm_run_unsafe_code \
  --log_samples \
  --limit $LM_LIMIT \
  --output_path lm_eval_results.json
INFO 11-20 08:03:58 [__init__.py:254] Automatically detected platform hpu.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8688, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=1, model='/root/.cache/huggingface/GLM-4.5-FP8', tokenizer=None, use_beam_search=False, num_prompts=16, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='10,90,99', goodput=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=30151, random_output_len=230, random_range_ratio=0.8, random_prefix_len=0, random_image_width=1280, random_image_height=720, bench_single_image_path=None, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████| 16/16 [21:18<00:00, 79.91s/it]
============ Serving Benchmark Result ============
Successful requests:                     16
Benchmark duration (s):                  1278.59
Total input tokens:                      440126
Total generated tokens:                  3239
Request throughput (req/s):              0.01
Output token throughput (tok/s):         2.53
Total Token throughput (tok/s):          346.76
---------------Time to First Token----------------
Mean TTFT (ms):                          24470.15
Median TTFT (ms):                        23564.32
P10 TTFT (ms):                           15507.92
P90 TTFT (ms):                           34069.66
P99 TTFT (ms):                           35588.77
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          275.53
Median TPOT (ms):                        269.65
P10 TPOT (ms):                           183.75
P90 TPOT (ms):                           362.86
P99 TPOT (ms):                           416.81
---------------Inter-token Latency----------------
Mean ITL (ms):                           275.22
Median ITL (ms):                         249.65
P10 ITL (ms):                            104.88
P90 ITL (ms):                            483.85
P99 ITL (ms):                            670.55
----------------End-to-end Latency----------------
Mean E2EL (ms):                          79910.56
Median E2EL (ms):                        73751.59
P10 E2EL (ms):                           53952.02
P90 E2EL (ms):                           106019.00
P99 E2EL (ms):                           115339.21
==================================================
INFO 11-20 08:26:30 [__init__.py:254] Automatically detected platform hpu.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8688, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=2, model='/root/.cache/huggingface/GLM-4.5-FP8', tokenizer=None, use_beam_search=False, num_prompts=32, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='10,90,99', goodput=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=30151, random_output_len=230, random_range_ratio=0.8, random_prefix_len=0, random_image_width=1280, random_image_height=720, bench_single_image_path=None, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 2
100%|████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████| 32/32 [07:13<00:00, 13.54s/it]
============ Serving Benchmark Result ============
Successful requests:                     32
Benchmark duration (s):                  433.27
Total input tokens:                      860110
Total generated tokens:                  6622
Request throughput (req/s):              0.07
Output token throughput (tok/s):         15.28
Total Token throughput (tok/s):          2000.46
---------------Time to First Token----------------
Mean TTFT (ms):                          8449.41
Median TTFT (ms):                        8272.26
P10 TTFT (ms):                           6826.56
P90 TTFT (ms):                           9894.66
P99 TTFT (ms):                           12895.72
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          90.08
Median TPOT (ms):                        89.89
P10 TPOT (ms):                           81.35
P90 TPOT (ms):                           101.72
P99 TPOT (ms):                           129.25
---------------Inter-token Latency----------------
Mean ITL (ms):                           90.15
Median ITL (ms):                         52.07
P10 ITL (ms):                            49.33
P90 ITL (ms):                            54.62
P99 ITL (ms):                            63.11
----------------End-to-end Latency----------------
Mean E2EL (ms):                          27015.65
Median E2EL (ms):                        27152.89
P10 E2EL (ms):                           23553.70
P90 E2EL (ms):                           30395.38
P99 E2EL (ms):                           35911.40
==================================================
INFO 11-20 08:34:49 [__init__.py:254] Automatically detected platform hpu.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8688, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=4, model='/root/.cache/huggingface/GLM-4.5-FP8', tokenizer=None, use_beam_search=False, num_prompts=64, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='10,90,99', goodput=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=30151, random_output_len=230, random_range_ratio=0.8, random_prefix_len=0, random_image_width=1280, random_image_height=720, bench_single_image_path=None, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 4
100%|████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████| 64/64 [11:49<00:00, 11.08s/it]
============ Serving Benchmark Result ============
Successful requests:                     64
Benchmark duration (s):                  709.06
Total input tokens:                      1726426
Total generated tokens:                  13125
Request throughput (req/s):              0.09
Output token throughput (tok/s):         18.51
Total Token throughput (tok/s):          2453.33
---------------Time to First Token----------------
Mean TTFT (ms):                          9533.22
Median TTFT (ms):                        9549.60
P10 TTFT (ms):                           6833.14
P90 TTFT (ms):                           12867.30
P99 TTFT (ms):                           21024.24
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          167.95
Median TPOT (ms):                        173.46
P10 TPOT (ms):                           128.06
P90 TPOT (ms):                           204.86
P99 TPOT (ms):                           226.29
---------------Inter-token Latency----------------
Mean ITL (ms):                           168.67
Median ITL (ms):                         55.06
P10 ITL (ms):                            53.49
P90 ITL (ms):                            58.12
P99 ITL (ms):                            6918.20
----------------End-to-end Latency----------------
Mean E2EL (ms):                          43954.81
Median E2EL (ms):                        44798.34
P10 E2EL (ms):                           32780.56
P90 E2EL (ms):                           54750.34
P99 E2EL (ms):                           63922.84
==================================================


VEs 1

VEs 2 - 8192 chunks

NA

VEs 1 - 8192 chunks

NA